<template>
  <div class="page-line-chart">
    <h4>今日文章数据</h4>
    <Veline :data="chartData"></Veline>
  </div>
</template>

<script>

import Veline from "v-charts/lib/line.common"
export default {
  components:{
    Veline
  },
  data() {
    return {
      chartData: {
        columns: ["日期", "阅读用户", "评论用户", "好评率"],
        rows: [
          { 日期: "1", 阅读用户: 1393, 评论用户: 1093, 好评率: 0.32 },
          { 日期: "2", 阅读用户: 3530, 评论用户: 3230, 好评率: 0.26 },
          { 日期: "3", 阅读用户: 2923, 评论用户: 2623, 好评率: 0.76 },
          { 日期: "4", 阅读用户: 1723, 评论用户: 1423, 好评率: 0.49 },
          { 日期: "5", 阅读用户: 3792, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "6", 阅读用户: 4593, 评论用户: 4293, 好评率: 0.78 },
          { 日期: "7", 阅读用户: 5624, 评论用户: 1401, 好评率: 0.88 },
          { 日期: "8", 阅读用户: 6541, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "9", 阅读用户: 1001, 评论用户: 1045, 好评率: 0.88 },
          { 日期: "10", 阅读用户: 3647, 评论用户: 4514, 好评率: 0.323 },
          { 日期: "11", 阅读用户: 6471, 评论用户: 1014, 好评率: 0.45 },
          { 日期: "12", 阅读用户: 3014, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "13", 阅读用户: 5478, 评论用户: 6365, 好评率: 0.323 },
          { 日期: "14", 阅读用户: 6580, 评论用户: 4140, 好评率: 0.323 },
          { 日期: "15", 阅读用户: 3792, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "16", 阅读用户: 5847, 评论用户: 4104, 好评率: 0.323 },
          { 日期: "17", 阅读用户: 3792, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "18", 阅读用户: 6320, 评论用户: 1401, 好评率: 0.323 },
          { 日期: "19", 阅读用户: 1010, 评论用户: 3492, 好评率: 0.323 },
          { 日期: "20", 阅读用户: 1047, 评论用户: 3014, 好评率: 0.323 },

        ]
      }
    };
  }
};
</script>